<?php

namespace App\Models;

use Illuminate\Database\Eloquent\Factories\HasFactory;
use Illuminate\Database\Eloquent\Model;
use Illuminate\database\Eloquent\SoftDeletes;

class Post extends Model
{
    use HasFactory, SoftDeletes;

    protected $fillable = [
        'day',
        'selection',
        'main',
        'sub',
        'amount',
        'comment',
    ];
    // 収入
    static $Income_mains = [
        '利子'  => '利子',
        '配当'  => '配当',
        '不動産'  => '不動産',
        '事業' => '事業',
        '給与' => '給与',
        '退職' => '退職',
        '山林' => '山林',
        '譲渡' => '譲渡',
        '一時' => '一時',
        '雑' => '雑',
    ];
    static $Interest_rates = [
        '国内'  => '国内', '米国'  => '米国', '新興国'  => '新興国', 'その他' => 'その他',
    ];
    static $dividends = [
        '国内'  => '国内', '米国'  => '米国', '新興国'  => '新興国', 'その他' => 'その他',
    ];
    static $real_estates = [
        '国内'  => '国内', '米国'  => '米国', '新興国'  => '新興国', 'その他' => 'その他',
    ];
    static $businesses = [
        '国内'  => '国内', '米国'  => '米国', '新興国'  => '新興国', 'その他' => 'その他',
    ];
    static $salaries = [
        '給与①'  => '給与①', '給与②'  => '給与②', '給与③'  => '給与③', '給与④' => '給与④',
    ];
    static $retirements = [
        '退職'  => '退職',
    ];
    static $forest = [
        '山林'  => '山林',
    ];
    static $assignments = [
        '国内'  => '国内', '米国'  => '米国', '新興国'  => '新興国', 'その他' => 'その他',

    ];
    static $temporarise = [
        '一時①'  => '一時①', '一時②'  => '一時②', '一時③'  => '一時③', '一時④' => '一時④',
    ];
    static $miscellanies = [
        '雑①'  => '雑①', '雑②'  => '雑②', '雑③'  => '雑③', '雑④' => '雑④',
    ];

    // 支出
    static $expenditure_mains = [
        //変動費
        '食費'  => '食費',
        '日用品'=> '日用品',
        '趣味・娯楽'  => '趣味・娯楽',
        '交際費' => '交際費',
        '衣服・美容' => '衣服・美容',
        '健康・医療' => '健康・医療',
        '自動車' => '自動車',
        '自己投資' => '自己投資',
        '教育・養育' => '教育・養育',
        'その他変動費' => 'その他変動費',
        //固定費
        '住居費' => '住居費',
        '水道・光熱費' => '水道・光熱費',
        '通信費' => '通信費',
        '税' => '税',
        '社会保障費' => '社会保障費',
        '保険' => '保険',
        'サブスク' => 'サブスク',
        'その他固定費' => 'その他固定費',
    ];

    static $food_costs = [
        '食費'  => '食費', '外食費'  => '外食費', 'その他食費' => 'その他食費',
    ];
    static $daily_use_items = [
        '日用品'  => '日用品', '子育て日用品'  => '子育て日用品', 'その他日用品'  => 'その他日用品',
    ];
    static $hobbies_amusements = [
        '趣味①'  => '趣味①', '趣味②'  => '趣味②', '旅行費'  => '旅行費', 'その他趣味・娯楽費' => 'その他趣味・娯楽費',
    ];
    static $entertainment_expenses = [
        '交際費'  => '交際費', '飲み会'  => '飲み会', '冠婚葬祭'  => '冠婚葬祭', 'その他交際費' => 'その他交際費',
    ];
    static $clothing_beauty = [
        '衣服'  => '衣服', 'その他衣服'  => 'その他衣服', '美容'  => '美容', 'その他美容' => 'その他美容',
    ];
    static $health_medical = [
        '健康'  => '健康', 'その他健康'  => 'その他健康', '医療'  => '医療', 'その他医療' => 'その他医療',
    ];
    static $automobile = [
        'ガソリン'  => 'ガソリン', '車検'  => '車検', '駐車場'  => '駐車場', 'その他自動車' => 'その他自動車',
    ];
    static $self_investments = [
        '書籍・参考書'  => '書籍・参考書', '資格取得費'  => '資格取得費', 'その他自己投資' => 'その他自己投資',
    ];
    static $education = [
        '教育費'  => '教育費', 'その他教育費'  => 'その他教育費', '養育費'  => '養育費', 'その他養育費' => 'その他養育費',
    ];
    static $variable_costs = [
        'その他変動費'  => 'その他変動費',
    ];
    static $residence = [
        '家賃'  => '家賃', 'その他住居費'  => 'その他住居費',
    ];
    static $water_utilities = [
        '水道'  => '水道', '電気'  => '電気', 'ガス'  => 'ガス', 'その他水道・光熱費' => 'その他水道・光熱費',
    ];
    static $communication_cost = [
        '携帯'  => '携帯', '回線・Wi-Fi'  => '回線・Wi-Fi', '切手・配送料'  => '切手・配送料', 'その他通信費' => 'その他通信費',
    ];
    static $taxes = [
        '住民税'  => '住民税', '所得税'  => '所得税', '配当金・分配金による税'  => '配当金・分配金による税', '譲渡益税' => '譲渡益税', 'その他税' => 'その他税',
    ];
    static $social_security = [
        '医療保険（健康保険・国民健康保険）'  => '医療保険（健康保険・国民健康保険）', '年金保険（国民・厚生）'  => '年金保険（国民・厚生）', '介護保険'  => '介護保険', 'その他社会保障費' => 'その他社会保障費',
    ];
    static $insurance = [
        '雇用保険'  => '雇用保険', '生命保険'  => '生命保険', '火災保険'  => '火災保険', 'その他保険' => 'その他保険',
    ];
    static $subscription = [
        'サブスク①'  => 'サブスク①', 'サブスク②'  => 'サブスク②', 'サブスク③'  => 'サブスク③', 'サブスク④' => 'サブスク④',
    ];
    static $fixed_cost = [
        'その他固定費'  => 'その他固定費',
    ];
}
